## Pandas DataFrame

In [1]:
import pandas as pd
df = pd.DataFrame([
    ['frank', 'M', 29], 
    ['mary', 'F', 23], 
    ['tom', 'M', 35],
    ['ted', 'M', 33], 
    ['jean', 'F', 21], ['lisa', 'F', 20]]
    )

In [4]:
#print(df)
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [5]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [6]:
df.columns = ['name', 'gender', 'age']

In [7]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [8]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [9]:
?df.head()

In [10]:
df.head(3)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [11]:
df.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   gender  6 non-null      object
 2   age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [13]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [14]:
df.dtypes

name      object
gender    object
age        int64
dtype: object

In [15]:
# select name from df
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [17]:
type(df['name'])

pandas.core.series.Series

In [18]:
# select name, age from df
df[['name', 'age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [20]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [22]:
# select * from df where geder = 'M'
df[df['gender'] == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [24]:
(df['gender'] == 'M') & (df['age'] >=30)

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [25]:
# select * from df where gender = 'M' and age >=30
df[(df['gender'] == 'M') & (df['age'] >=30)]

  name gender  age
2  tom      M   35
3  ted      M   33

In [26]:
# select * from df where gender = 'M' or age >=30
df[(df['gender'] == 'M') | (df['age'] >=30)]

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [27]:
# alter table df add column employee default TRUE
df['employee'] = True

In [28]:
df.head()

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True

In [29]:
del df['employee']

In [30]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [31]:
df['employee'] = True

In [35]:
# axis =0 : row
# axis =1 : column
# inplace = False: do not take action
# inplace = True: Take action
df.drop('employee', axis = 1, inplace = True)

In [36]:
df.head(3)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [38]:
df['userid'] = range(101,107)

In [39]:
df.head(3)

    name gender  age  userid
0  frank      M   29     101
1   mary      F   23     102
2    tom      M   35     103

In [41]:
df.set_index('userid', inplace=True)

In [42]:
df.head()

         name gender  age
userid
101     frank      M   29
102      mary      F   23
103       tom      M   35
104       ted      M   33
105      jean      F   21

In [46]:
# iloc : by location
# loc : by label (index)
df.iloc[ 0 , 0]
df.iloc[0,:]
df.iloc[:,0]
df.iloc[[0,2,4],[0,2]]

         name  age
userid
101     frank   29
103       tom   35
105      jean   21

In [47]:
df.loc[[101,102,103],['name', 'age']]

         name  age
userid
101     frank   29
102      mary   23
103       tom   35

In [48]:
df.loc[:,['name', 'age']]

         name  age
userid
101     frank   29
102      mary   23
103       tom   35
104       ted   33
105      jean   21
106      lisa   20

In [49]:
# select name, age from df where gender = 'M'
df.loc[df['gender'] == 'M',['name', 'age']]

         name  age
userid
101     frank   29
103       tom   35
104       ted   33

In [52]:
# select age from df where gender = 'M'
df[df['gender'] == 'M']['age']

df.loc[df['gender'] == 'M', 'age']

userid
101    29
103    35
104    33
Name: age, dtype: int64

In [53]:
df.loc[df['gender'] == 'M', 'age'].mean()

32.333333333333336

In [54]:
df.loc[df['gender'] == 'M', 'age'].median()

33.0

In [55]:
df.loc[df['gender'] == 'F', 'age'].mean()

21.333333333333332

In [56]:
# select gender, AVG(age) from df group by gender
df.groupby(['gender'])['age'].mean()

gender
F    21.333333
M    32.333333
Name: age, dtype: float64

In [57]:
df1= pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3'],'C': ['C0', 'C1', 'C2', 'C3'],'D': ['D0', 'D1', 'D2', 'D3']},index=[0,1,2,3])
df2= pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],'B': ['B4', 'B5', 'B6', 'B7'],'C': ['C4', 'C5', 'C6', 'C7'],'D': ['D4', 'D5', 'D6', 'D7']},index=[4,5,6,7])
df3= pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],'B': ['B8', 'B9', 'B10', 'B11'],'C': ['C8', 'C9', 'C10', 'C11'],'D':['D8', 'D9', 'D10', 'D11']},index=[8,9, 10, 11])

In [58]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [59]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [60]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [61]:
# axis = 0, combined by row
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [63]:
# axis = 0, combined by column
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [64]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']})

In [65]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [66]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [67]:
# select * from left inner join right on left.key = right.key
pd.merge(left, right, how ='inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [68]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
'key2': ['K0', 'K1', 'K0', 'K1'],
'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
'key2': ['K0', 'K0', 'K0', 'K0'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']})

In [69]:
pd.merge(left, right, how ='inner', on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [70]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
'B': ['B0', 'B1', 'B2']},
index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
'D': ['D0', 'D2', 'D3']},
index=['K0', 'K2', 'K3'])

In [71]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [72]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [73]:
# left join by index name
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [74]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/ywchiu/esunpy/master/data/Churn_Modelling.csv')

In [75]:
df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]